#include <stdio.h>
#include <stdlib.h>
#include "BookManager.h"
#include <malloc.h>

int main(int argc, char *argv[]) 
{
	Sqlist l;
	Linklist L;
	printf("          ****************************************************\n");
	printf("                                欢迎使用                       \n");
	printf("                            图书信息管理系统                      \n");
	printf("          ****************************************************\n");
	printf("\n");
	printf("          ****************************************************\n");
	printf("          ****************************************************\n");
	printf("                         您可以选择以下任意一项                        \n");
	printf("                      1    顺序表图书管理系统                      \n");
	printf("                      2    线性表图书管理系统                        \n");
	printf("                      3          退出                            \n");
	printf("          ****************************************************\n");
	printf("          ****************************************************\n");
	printf("\n");
   int choic,flag;
   printf("请输入你的选择：\n");
   scanf("%d",&choic);
   while(choic!=3)
   {
   
   switch(choic)
   {
   	 case 1:
   	printf("          ****************************************************\n");
	printf("                                欢迎使用                       \n");
	printf("                           顺序表图书管理系统                      \n");
	printf("          ****************************************************\n");
	printf("                     您可以选择以下任意一项进行操作：                        \n");
	printf("          1.图书信息表的创建                    2.图书信息表的输出                                 \n");
	printf("          3.图书信息表新图书的入库              4.图书信息表旧图书的出库                      \n");
	printf("          5.图书信息表最贵图书的查找            0.退出                      \n");
	printf("          ****************************************************\n");
	printf("          ****************************************************\n");
	printf("\n");
	printf("请输入你的选择：\n");
			scanf("%d",&flag);
			while(flag!=0)
			{
				switch(flag)
				{
					case 1:
					CreatList_Sq(&l);
					break;
					case 2:
					PrintList_Sq(l);
					break;
					case 3:
					AddBook_Sq(&l);
					break;
					case 4:
					DelBook_Sq(&l);
					break;
					case 5:
					SerchMostValue_Sq(l);
					break;
					case 0:
					printf("已退出顺序表图书管理系统，欢迎下次使用！\n");
					return;
					default:
					printf("输入有误，请重新输入！\n");
					break;
				}
	printf("          ****************************************************\n");
	printf("                                欢迎使用                       \n");
	printf("                           顺序表图书管理系统                      \n");
	printf("          ****************************************************\n");
	printf("                     您可以选择以下任意一项进行操作：                        \n");
	printf("          1.图书信息表的创建                    2.图书信息表的输出                                 \n");
	printf("          3.图书信息表新图书的入库              4.图书信息表旧图书的出库                      \n");
	printf("          5.图书信息表最贵图书的查找            0.退出                      \n");
	printf("          ****************************************************\n");
	printf("          ****************************************************\n");
	printf("\n");
	printf("请输入你的选择：\n");
				scanf("%d",&flag);
			}
   	 break;
   	 case 2:
   	printf("          ****************************************************\n");
	printf("                                欢迎使用                       \n");
	printf("                           线性表图书管理系统                      \n");
	printf("          ****************************************************\n");
	printf("                     您可以选择以下任意一项进行操作：                        \n");
	printf("          1.图书信息表的创建                    2.图书信息表的输出                                 \n");
	printf("          3.图书信息表新图书的入库              4.图书信息表旧图书的出库                      \n");
	printf("          5.图书信息表最贵图书的查找            0.退出                      \n");
	printf("          ****************************************************\n");
	printf("          ****************************************************\n");
	printf("\n");
	printf("请输入你的选择：\n");
			scanf("%d",&flag);
			while(flag!=0)
			{
				switch(flag)
				{
					case 1:
				   L = (Linklist) malloc (sizeof(Linklist)); //给头结点分配空间
       				if(L == NULL)
	   				{
          				printf("malloc 失败!\n");
       				}
      				 L->next = NULL;
    				L=CreatLinklist(L);
					break;
					case 2:
					PrintLinklist(L);
					break;
					case 3:
					L=AddBook_linklist(L);
					break;
					case 4:
					L=DelBook_linklist(L);
					break;
					case 5:
					L=SortLinklist(L);
					break;
					case 0:
					printf("已退出线性表图书管理系统，欢迎下次使用！\n");
					return;
					default:
					printf("输入有误，请重新输入！\n");
					break;
				}
	printf("          ****************************************************\n");
	printf("                                欢迎使用                       \n");
	printf("                           线性表图书管理系统                      \n");
	printf("          ****************************************************\n");
	printf("                     您可以选择以下任意一项进行操作：                        \n");
	printf("          1.图书信息表的创建                    2.图书信息表的输出                                 \n");
	printf("          3.图书信息表新图书的入库              4.图书信息表旧图书的出库                      \n");
	printf("          5.图书信息表的排序                    0.退出                      \n");
	printf("          ****************************************************\n");
	printf("          ****************************************************\n");
	printf("\n");
	printf("请输入你的选择：\n");
				scanf("%d",&flag);
			}
   	 break;
   	 case 3:
   	 printf("已退出图书信息管理系统，欢迎下次使用！\n");
	 break;	
   	 default :
   	 printf("输入有误，请重新输入！\n");
	 break;	
	 
   } 
    printf("          ****************************************************\n");
	printf("                                欢迎使用                       \n");
	printf("                            图书信息管理系统                      \n");
	printf("          ****************************************************\n");
	printf("\n");
	printf("          ****************************************************\n");
	printf("          ****************************************************\n");
	printf("                         您可以选择以下任意一项                        \n");
	printf("                      1    顺序表图书管理系统                      \n");
	printf("                      2    线性表图书管理系统                        \n");
	printf("                      3          退出                            \n");
	printf("          ****************************************************\n");
	printf("          ****************************************************\n");
	printf("\n"); 
	scanf("%d",&choic);
}
	return 0;
}